Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/fuses.h
/* -------- FUSES_FUCFG1 : (FUSES Offset: 0x44) (R/W 32) User Configuration 1 (System Bus Configuration) -------- */
#define FUSES_FUCFG1_SSXEXDRM_Pos             _UINT32_(0)                                          /* (FUSES_FUCFG1) Execute from System Memory Position */
#define FUSES_FUCFG1_SSXEXDRM_Msk             (_UINT32_(0xFF) << FUSES_FUCFG1_SSXEXDRM_Pos)        /* (FUSES_FUCFG1) Execute from System Memory Mask */
#define FUSES_FUCFG1_SSXEXDRM(value)          (FUSES_FUCFG1_SSXEXDRM_Msk & (_UINT32_(value) << FUSES_FUCFG1_SSXEXDRM_Pos)) /* Assigment of value for SSXEXDRM in the FUSES_FUCFG1 register */
#define FUSES_FUCFG1_SSXEXEBI_Pos             _UINT32_(8)                                          /* (FUSES_FUCFG1) Execute from EBI attached Memory Position */
#define FUSES_FUCFG1_SSXEXEBI_Msk             (_UINT32_(0xFF) << FUSES_FUCFG1_SSXEXEBI_Pos)        /* (FUSES_FUCFG1) Execute from EBI attached Memory Mask */
#define FUSES_FUCFG1_SSXEXEBI(value)          (FUSES_FUCFG1_SSXEXEBI_Msk & (_UINT32_(value) << FUSES_FUCFG1_SSXEXEBI_Pos)) /* Assigment of value for SSXEXEBI in the FUSES_FUCFG1 register */
#define FUSES_FUCFG1_SSXEXSQI0_Pos            _UINT32_(16)                                         /* (FUSES_FUCFG1) Execute from SQI0 XIP Memory Position */
#define FUSES_FUCFG1_SSXEXSQI0_Msk            (_UINT32_(0xFF) << FUSES_FUCFG1_SSXEXSQI0_Pos)       /* (FUSES_FUCFG1) Execute from SQI0 XIP Memory Mask */
#define FUSES_FUCFG1_SSXEXSQI0(value)         (FUSES_FUCFG1_SSXEXSQI0_Msk & (_UINT32_(value) << FUSES_FUCFG1_SSXEXSQI0_Pos)) /* Assigment of value for SSXEXSQI0 in the FUSES_FUCFG1 register */
#define FUSES_FUCFG1_SSXEXSQI1_Pos            _UINT32_(24)                                         /* (FUSES_FUCFG1) Execute from SQI1 XIP Memory Position */
#define FUSES_FUCFG1_SSXEXSQI1_Msk            (_UINT32_(0xFF) << FUSES_FUCFG1_SSXEXSQI1_Pos)       /* (FUSES_FUCFG1) Execute from SQI1 XIP Memory Mask */
#define FUSES_FUCFG1_SSXEXSQI1(value)         (FUSES_FUCFG1_SSXEXSQI1_Msk & (_UINT32_(value) << FUSES_FUCFG1_SSXEXSQI1_Pos)) /* Assigment of value for SSXEXSQI1 in the FUSES_FUCFG1 register */
#define FUSES_FUCFG1_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (FUSES_FUCFG1) Register Mask  */


/* -------- FUSES_FUCFG2 : (FUSES Offset: 0x48) (R/W 32) User Configuration 2 (Deep Sleep SMOR Configuration) -------- */
#define FUSES_FUCFG2_BOR_HYST_Pos             _UINT32_(0)                                          /* (FUSES_FUCFG2) BOT Trip Hystersis Position */
#define FUSES_FUCFG2_BOR_HYST_Msk             (_UINT32_(0x1) << FUSES_FUCFG2_BOR_HYST_Pos)         /* (FUSES_FUCFG2) BOT Trip Hystersis Mask */
#define FUSES_FUCFG2_BOR_HYST(value)          (FUSES_FUCFG2_BOR_HYST_Msk & (_UINT32_(value) << FUSES_FUCFG2_BOR_HYST_Pos)) /* Assigment of value for BOR_HYST in the FUSES_FUCFG2 register */
#define FUSES_FUCFG2_BOR_TRIP_Pos             _UINT32_(1)                                          /* (FUSES_FUCFG2) BOT Trip Points Position */
#define FUSES_FUCFG2_BOR_TRIP_Msk             (_UINT32_(0x3) << FUSES_FUCFG2_BOR_TRIP_Pos)         /* (FUSES_FUCFG2) BOT Trip Points Mask */
#define FUSES_FUCFG2_BOR_TRIP(value)          (FUSES_FUCFG2_BOR_TRIP_Msk & (_UINT32_(value) << FUSES_FUCFG2_BOR_TRIP_Pos)) /* Assigment of value for BOR_TRIP in the FUSES_FUCFG2 register */
#define FUSES_FUCFG2_Msk                      _UINT32_(0x00000007)                                 /* (FUSES_FUCFG2) Register Mask  */


/* -------- FUSES_FUCFG3 : (FUSES Offset: 0x4C) (R/W 32) User Configuration 2 (SMOR Configuration) -------- */
#define FUSES_FUCFG3_HYST_BOR_VDDIO_Pos       _UINT32_(0)                                          /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDIO Position */
#define FUSES_FUCFG3_HYST_BOR_VDDIO_Msk       (_UINT32_(0x1) << FUSES_FUCFG3_HYST_BOR_VDDIO_Pos)   /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDIO Mask */
#define FUSES_FUCFG3_HYST_BOR_VDDIO(value)    (FUSES_FUCFG3_HYST_BOR_VDDIO_Msk & (_UINT32_(value) << FUSES_FUCFG3_HYST_BOR_VDDIO_Pos)) /* Assigment of value for HYST_BOR_VDDIO in the FUSES_FUCFG3 register */
#define FUSES_FUCFG3_BOR_TRIP_VDDIO_Pos       _UINT32_(1)                                          /* (FUSES_FUCFG3) BOR Trip Points for VDDIO Position */
#define FUSES_FUCFG3_BOR_TRIP_VDDIO_Msk       (_UINT32_(0x3) << FUSES_FUCFG3_BOR_TRIP_VDDIO_Pos)   /* (FUSES_FUCFG3) BOR Trip Points for VDDIO Mask */
#define FUSES_FUCFG3_BOR_TRIP_VDDIO(value)    (FUSES_FUCFG3_BOR_TRIP_VDDIO_Msk & (_UINT32_(value) << FUSES_FUCFG3_BOR_TRIP_VDDIO_Pos)) /* Assigment of value for BOR_TRIP_VDDIO in the FUSES_FUCFG3 register */
#define FUSES_FUCFG3_HYST_BOR_VDDA_Pos        _UINT32_(6)                                          /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDANA Position */
#define FUSES_FUCFG3_HYST_BOR_VDDA_Msk        (_UINT32_(0x1) << FUSES_FUCFG3_HYST_BOR_VDDA_Pos)    /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDANA Mask */
#define FUSES_FUCFG3_HYST_BOR_VDDA(value)     (FUSES_FUCFG3_HYST_BOR_VDDA_Msk & (_UINT32_(value) << FUSES_FUCFG3_HYST_BOR_VDDA_Pos)) /* Assigment of value for HYST_BOR_VDDA in the FUSES_FUCFG3 register */
#define FUSES_FUCFG3_BOR_TRIP_VDDA_Pos        _UINT32_(7)                                          /* (FUSES_FUCFG3) BOR Trip Points for VDDANA Position */
#define FUSES_FUCFG3_BOR_TRIP_VDDA_Msk        (_UINT32_(0x3) << FUSES_FUCFG3_BOR_TRIP_VDDA_Pos)    /* (FUSES_FUCFG3) BOR Trip Points for VDDANA Mask */
#define FUSES_FUCFG3_BOR_TRIP_VDDA(value)     (FUSES_FUCFG3_BOR_TRIP_VDDA_Msk & (_UINT32_(value) << FUSES_FUCFG3_BOR_TRIP_VDDA_Pos)) /* Assigment of value for BOR_TRIP_VDDA in the FUSES_FUCFG3 register */
#define FUSES_FUCFG3_HYST_BOR_VDDREG_Pos      _UINT32_(10)                                         /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDREG Position */
#define FUSES_FUCFG3_HYST_BOR_VDDREG_Msk      (_UINT32_(0x1) << FUSES_FUCFG3_HYST_BOR_VDDREG_Pos)  /* (FUSES_FUCFG3) BOR Trip Point Hystersis for VDDREG Mask */
#define FUSES_FUCFG3_HYST_BOR_VDDREG(value)   (FUSES_FUCFG3_HYST_BOR_VDDREG_Msk & (_UINT32_(value) << FUSES_FUCFG3_HYST_BOR_VDDREG_Pos)) /* Assigment of value for HYST_BOR_VDDREG in the FUSES_FUCFG3 register */
#define FUSES_FUCFG3_Msk                      _UINT32_(0x000005C7)                                 /* (FUSES_FUCFG3) Register Mask  */


